espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl602/bl602_std/bl602_std/Common/cipher_suite/src/bflb_ecdsa.c
#include "bflb_ecdsa.h"
#include "bflb_hash.h"
#include "stdint.h"
#include "bl602_sec_eng.h"
#include "bflb_platform.h"

#define ECP_SECP256R1_REG_TYPE                      SEC_ENG_PKA_REG_SIZE_32
#define ECP_SECP256R1_N_REG_INDEX                   0
#define ECP_SECP256R1_NPRIME_N_REG_INDEX            1
#define ECP_SECP256R1_INVR_N_REG_INDEX              2
#define ECP_SECP256R1_NPRIME_P_REG_INDEX            3
#define ECP_SECP256R1_INVR_P_REG_INDEX              4
#define ECP_SECP256R1_SIZE                          32
/* Used in verify */
#define ECP_SECP256R1_S_REG_INDEX                   5
#define ECP_SECP256R1_BAR_S_REG_INDEX               6
#define ECP_SECP256R1_HASH_REG_INDEX                6  //use ECP_SECP256R1_BAR_S_REG_INDEX since it's temp
#define ECP_SECP256R1_U1_REG_INDEX                  7
#define ECP_SECP256R1_LT_REG_TYPE                   SEC_ENG_PKA_REG_SIZE_64
#define ECP_SECP256R1_LT_REG_INDEX                  7
#define ECP_SECP256R1_SLT_REG_TYPE                  SEC_ENG_PKA_REG_SIZE_128
#define ECP_SECP256R1_SLT_REG_INDEX                 3

//#define ECDSA_DBG                                   1
//#define ECDSA_DBG_DETAIL                            1

#if (defined(ECDSA_DBG)||defined(ECDSA_DBG_DETAIL))
uint32_t pka_tmp[32]={0};
#endif

const uint8_t  secp256r1P[32] ALIGN4 ={
        0xff,0xff,0xff,0xff,0x00,0x00,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
        0x00,0x00,0x00,0x00,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff
};
const uint8_t secp256r1B[32] ALIGN4 ={
        0x5a,0xc6,0x35,0xd8,0xaa,0x3a,0x93,0xe7,0xb3,0xeb,0xbd,0x55,0x76,0x98,0x86,0xbc,
        0x65,0x1d,0x06,0xb0,0xcc,0x53,0xb0,0xf6,0x3b,0xce,0x3c,0x3e,0x27,0xd2,0x60,0x4b
};
const uint8_t secp256r1Gx[32] ALIGN4 ={
        0x6b,0x17,0xd1,0xf2,0xe1,0x2c,0x42,0x47,0xf8,0xbc,0xe6,0xe5,0x63,0xa4,0x40,0xf2,
        0x77,0x03,0x7d,0x81,0x2d,0xeb,0x33,0xa0,0xf4,0xa1,0x39,0x45,0xd8,0x98,0xc2,0x96
};
const uint8_t secp256r1Gy[32] ALIGN4 ={
        0x4f,0xe3,0x42,0xe2,0xfe,0x1a,0x7f,0x9b,0x8e,0xe7,0xeb,0x4a,0x7c,0x0f,0x9e,0x16,
        0x2b,0xce,0x33,0x57,0x6b,0x31,0x5e,0xce,0xcb,0xb6,0x40,0x68,0x37,0xbf,0x51,0xf5
};
const uint8_t secp256r1N[32] ALIGN4 ={
        0xff,0xff,0xff,0xff,0x00,0x00,0x00,0x00,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xbc,0xe6,0xfa,0xad,0xa7,0x17,0x9e,0x84,0xf3,0xb9,0xca,0xc2,0xfc,0x63,0x25,0x51
};
const uint8_t secp256r1PrimeN_N[32] ALIGN4 ={
        0x60,0xd0,0x66,0x33,0xa9,0xd6,0x28,0x1c,0x50,0xfe,0x77,0xec,0xc5,0x88,0xc6,0xf6,
        0x48,0xc9,0x44,0x08,0x7d,0x74,0xd2,0xe4,0xcc,0xd1,0xc8,0xaa,0xee,0x00,0xbc,0x4f
};
const uint8_t secp256r1InvR_N[32] ALIGN4 ={
        0x60,0xd0,0x66,0x33,0x49,0x05,0xc1,0xe9,0x07,0xf8,0xb6,0x04,0x1e,0x60,0x77,0x25,
        0xba,0xde,0xf3,0xe2,0x43,0x56,0x6f,0xaf,0xce,0x1b,0xc8,0xf7,0x9c,0x19,0x7c,0x79
};
const uint8_t secp256r1PrimeN_P[32] ALIGN4 ={
        0xff,0xff,0xff,0xff,0x00,0x00,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
        0x00,0x00,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01
};
const uint8_t secp256r1InvR_P[32] ALIGN4 ={
        0xff,0xff,0xff,0xfe,0x00,0x00,0x00,0x03,0xff,0xff,0xff,0xfd,0x00,0x00,0x00,0x02,
        0x00,0x00,0x00,0x01,0xff,0xff,0xff,0xfe,0x00,0x00,0x00,0x03,0x00,0x00,0x00,0x00
};
const uint8_t secp256r1_1[32] ALIGN4 ={
        0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
        0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01
};
const uint8_t secp256r1_BAR2[32] ALIGN4 ={
        0x00,0x00,0x00,0x01,0xff,0xff,0xff,0xfd,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xff,0xff,0xff,0xfe,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x02
};
const uint8_t secp256r1_BAR3[32] ALIGN4 ={
        0x00,0x00,0x00,0x02,0xff,0xff,0xff,0xfc,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xff,0xff,0xff,0xfd,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x03
};
const uint8_t secp256r1_BAR4[32] ALIGN4 ={
        0x00,0x00,0x00,0x03,0xff,0xff,0xff,0xfb,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xff,0xff,0xff,0xfc,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x04
};
const uint8_t secp256r1_BAR8[32] ALIGN4 ={
        0x00,0x00,0x00,0x07,0xff,0xff,0xff,0xf7,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xff,0xff,0xff,0xf8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x08
};
const uint8_t secp256r1_1P1[32] ALIGN4 ={
        0x00,0x00,0x00,0x00,0xff,0xff,0xff,0xfe,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xff,0xff,0xff,0xff,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x02
};
const uint8_t secp256r1_1M1[32] ALIGN4 ={
        0x00,0x00,0x00,0x00,0xff,0xff,0xff,0xfe,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xff,0xff,0xff,0xff,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
};
const uint8_t secp256r1_Zerox[32] ALIGN4 ={
         0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
         0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
};
const uint8_t secp256r1_Zeroy[32] ALIGN4 ={
        0x00,0x00,0x00,0x00,0xff,0xff,0xff,0xfe,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
        0xff,0xff,0xff,0xff,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01
};
const uint8_t secp256r1_Gx[32] ALIGN4 ={
        0x18,0x90,0x5f,0x76,0xa5,0x37,0x55,0xc6,0x79,0xfb,0x73,0x2b,0x77,0x62,0x25,0x10,
        0x75,0xba,0x95,0xfc,0x5f,0xed,0xb6,0x01,0x79,0xe7,0x30,0xd4,0x18,0xa9,0x14,0x3c
};
const uint8_t secp256r1_Gy[32] ALIGN4 ={
        0x85,0x71,0xff,0x18,0x25,0x88,0x5d,0x85,0xd2,0xe8,0x86,0x88,0xdd,0x21,0xf3,0x25,
        0x8b,0x4a,0xb8,0xe4,0xba,0x19,0xe4,0x5c,0xdd,0xf2,0x53,0x57,0xce,0x95,0x56,0x0a
};

int bflb_ecc_basic_parameter_init(uint8_t id)
{
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,(uint32_t *)secp256r1N,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_NPRIME_N_REG_INDEX,(uint32_t *)secp256r1PrimeN_N,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_INVR_N_REG_INDEX,(uint32_t *)secp256r1InvR_N,ECP_SECP256R1_SIZE/4,0);

