espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl602/bl602_std/bl602_std/Common/cipher_suite/src/bflb_ecdsa.c
    return 0;
}

int bflb_ecc_point_mul_init(uint8_t id)
{
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,0,(uint32_t *)secp256r1P,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,1,(uint32_t *)secp256r1PrimeN_P,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,8,(uint32_t *)secp256r1_1,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,9,(uint32_t *)secp256r1_BAR2,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,10,(uint32_t *)secp256r1_BAR3,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,11,(uint32_t *)secp256r1_BAR4,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,12,(uint32_t *)secp256r1_BAR8,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,19,(uint32_t *)secp256r1_1P1,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,20,(uint32_t *)secp256r1_1M1,ECP_SECP256R1_SIZE/4,0);

    return 0;
}

void bflb_ecdsa_point_add_inf_check(uint8_t *pka_p1_eq_inf,uint8_t *pka_p2_eq_inf)
{
    uint8_t res[4];

    /* index 2:BAR_Zero_x
     * index 3:BAR_Zero_y
     * index 4:BAR_Zero_z
     * index 5:BAR_G_x
     * index 6:BAR_G_y
     * index 7:BAR_G_z
     * index 8:1
     * index 9:2
     * index 10:3
     * index 11:4
     * index 12:8
     * index 19:1P1
     * index 20:1m1*/

    //cout = 1 if X1 = 0
    Sec_Eng_PKA_LCMP(res,3,2,3,8);//s0 < s1 => cout = 1
    //cout = 1 if Y1 < Bar_1p1
    Sec_Eng_PKA_LCMP(res+1,3,3,3,19);
    //cout=1 if Y1 > Bar_1m1
    Sec_Eng_PKA_LCMP(res+2,3,20,3,3);
    //cout =1 if Z1 = 0
    Sec_Eng_PKA_LCMP(res+3,3,4,3,8);
    *pka_p1_eq_inf = res[0]&res[1]&res[2]&res[3];

    //cout = 1 if X2 = 0
    Sec_Eng_PKA_LCMP(res,3,5,3,8);
    // cout = 1 if Y2 < Bar_1p1
    Sec_Eng_PKA_LCMP(res+1,3,6,3,19);
    //cout = 1 if Y2 > Bar_1m1
    Sec_Eng_PKA_LCMP(res+2,3,20,3,6);
    //cout = 1 if Z2 = 0
    Sec_Eng_PKA_LCMP(res+3,3,7,3,8);
    *pka_p2_eq_inf = res[0]&res[1]&res[2]&res[3];
}

void bflb_ecdsa_copy_x2_to_x1(uint8_t id)
{
    //X2->X1
    Sec_Eng_PKA_Move_Data(3,2,3,5,0);
    //Y2->Y1
    Sec_Eng_PKA_Move_Data(3,3,3,6,0);
    //Z2->Z1
    Sec_Eng_PKA_Move_Data(3,4,3,7,1);//Caution!!! wait movdat ready to execute next command
}

void bflb_ecdsa_point_add(uint8_t id)
{
    /* index 2:BAR_Zero_x
     * index 3:BAR_Zero_y
     * index 4:BAR_Zero_z
     * index 5:BAR_G_x
     * index 6:BAR_G_y
     * index 7:BAR_G_z
     * index 8:1
     * index 9:2
     * index 10:3
     * index 11:4
     * index 12:8
     * index 19:1P1
     * index 20:1m1*/

    //U1 = Y2*Z1
    //PKA_MMUL(0,3,13,3, 6,3, 4,3,0);//d_reg_type,d_reg_idx,s0_reg_type,s0_reg_idx,s1_reg_type,s1_reg_idx,s2_reg_type,s2_reg_idx
    Sec_Eng_PKA_MMUL(3,13,3,6,3,4,3,0,0);

    //U2 = Y1*Z2
    //PKA_MMUL(0,3,14,3, 3,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3,14,3,3,3,7,3,0,0);

    //V1 = X2*Z1
    //PKA_MMUL(0,3,15,3, 5,3, 4,3,0);
    Sec_Eng_PKA_MMUL(3,15,3,5,3,4,3,0,0);

    //V2 = X1*Z2
    //PKA_MMUL(0,3,16,3, 2,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3,16,3,2,3,7,3,0,0);

    //U = U1-U2
    //PKA_MSUB(0,3,13,3,13,3,14,3,0);
    Sec_Eng_PKA_MSUB(3,13,3,13,3,14,3,0,0);

    //V = V1-V2
    //PKA_MSUB(0,3,15,3,15,3,16,3,0);
    Sec_Eng_PKA_MSUB(3,15,3,15,3,16,3,0,0);

    //W = Z1*Z2
    //PKA_MMUL(0,3, 2,3, 4,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3,2,3,4,3,7,3,0,0);

    //V^2
    //PKA_MMUL(0,3, 3,3,15,3,15,3,0);
    Sec_Eng_PKA_MMUL(3,3,3,15,3,15,3,0,0);

    //V^3
    //PKA_MMUL(0,3, 4,3, 3,3,15,3,0);
    Sec_Eng_PKA_MMUL(3,4,3,3,3,15,3,0,0);

    //U^2
    //PKA_MMUL(0,3,17,3,13,3,13,3,0);
    Sec_Eng_PKA_MMUL(3,17,3,13,3,13,3,0,0);

    //U^2*W
    //PKA_MMUL(0,3,17,3,17,3, 2,3,0);
    Sec_Eng_PKA_MMUL(3,17,3,17,3,2,3,0,0);

    //U^2*W-V^3
    //PKA_MSUB(0,3,17,3,17,3, 4,3,0);
    Sec_Eng_PKA_MSUB(3,17,3,17,3,4,3,0,0);

    //2*V^2
    //PKA_MMUL(0,3,18,3, 9,3, 3,3,0);
    Sec_Eng_PKA_MMUL(3,18,3,9,3,3,3,0,0);
    
    //2*V^2*V2
    //PKA_MMUL(0,3,18,3,18,3,16,3,0);
    Sec_Eng_PKA_MMUL(3,18,3,18,3,16,3,0,0);

    //A = U^2*W-V^3-2*V^2*V2
    //PKA_MSUB(0,3,18,3,17,3,18,3,0);
    Sec_Eng_PKA_MSUB(3,18,3,17,3,18,3,0,0);

    //V^2*V2
    //PKA_MMUL(0,3, 3,3, 3,3,16,3,0);
    Sec_Eng_PKA_MMUL(3,3,3,3,3,16,3,0,0);

    //V^3*U2
    //PKA_MMUL(0,3,14,3, 4,3,14,3,0);
    Sec_Eng_PKA_MMUL(3,14,3,4,3,14,3,0,0);

    //Z3 = V^3*W
    //PKA_MMUL(0,3, 4,3, 4,3, 2,3,0);
    Sec_Eng_PKA_MMUL(3,4,3,4,3,2,3,0,0);

    //X3 = V*A
    //PKA_MMUL(0,3, 2,3,15,3,18,3,0);
    Sec_Eng_PKA_MMUL(3,2,3,15,3,18,3,0,0);

    //V^2*V2-A
    //PKA_MSUB(0,3, 3,3, 3,3,18,3,0);
    Sec_Eng_PKA_MSUB(3,3,3,3,3,18,3,0,0);

    //U*(V^2*V2-A)
    //PKA_MMUL(0,3, 3,3,13,3, 3,3,0);
    Sec_Eng_PKA_MMUL(3,3,3,13,3,3,3,0,0);

    //Y3 = U*(V^2*V2-A)-V^3*U2
    //PKA_MSUB(1,3, 3,3, 3,3,14,3,0);
    Sec_Eng_PKA_MSUB(3,3,3,3,3,14,3,0,1);

}

void bflb_ecdsa_point_double(uint8_t id)
{
    /* index 2:BAR_Zero_x
     * index 3:BAR_Zero_y
     * index 4:BAR_Zero_z
     * index 5:BAR_G_x
     * index 6:BAR_G_y
     * index 7:BAR_G_z
     * index 8:1
     * index 9:2
     * index 10:3
     * index 11:4
     * index 12:8
     * index 19:1P1
     * index 20:1m1*/

    //X1^2
    //PKA_MMUL(0,3,13,3, 5,3, 5,3,0);//d_reg_type,d_reg_idx,s0_reg_type,s0_reg_idx,s1_reg_type,s1_reg_idx,s2_reg_type,s2_reg_idx
    Sec_Eng_PKA_MMUL(3,13,3,5,3,5,3,0,0);

    //Z1^2
    //PKA_MMUL(0,3,14,3, 7,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3,14,3,7,3,7,3,0,0);

    //X1^2-Z1^2
    //PKA_MSUB(0,3,13,3,13,3,14,3,0);
    Sec_Eng_PKA_MSUB(3,13,3,13,3,14,3,0,0);
    
    //W = 3*(X1^2-Z1^2)
    //PKA_MMUL(0,3,13,3,10,3,13,3,0);
    Sec_Eng_PKA_MMUL(3,13,3,10,3,13,3,0,0);
    
    //S = Y1*Z1
    //PKA_MMUL(0,3,14,3, 6,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3,14,3,6,3,7,3,0,0);
    
    //X1*Y1
    //PKA_MMUL(0,3,15,3, 5,3, 6,3,0);
    Sec_Eng_PKA_MMUL(3,15,3,5,3,6,3,0,0);
    
    //W^2
    //PKA_MMUL(0,3, 7,3,13,3,13,3,0);
    Sec_Eng_PKA_MMUL(3,7,3,13,3,13,3,0,0);
    
    //B = X1*Y1*S
    //PKA_MMUL(0,3,15,3,15,3,14,3,0);
    Sec_Eng_PKA_MMUL(3,15,3,15,3,14,3,0,0);
    
