espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl602/bl602_std/bl602_std/Common/cipher_suite/src/bflb_ecdsa.c
    //8*B
    //PKA_MMUL(0,3, 5,3,12,3,15,3,0);
    Sec_Eng_PKA_MMUL(3,5,3,12,3,15,3,0,0);
    
    //H = W^2-8*B
    //PKA_MSUB(0,3, 7,3, 7,3, 5,3,0);
    Sec_Eng_PKA_MSUB(3,7,3,7,3,5,3,0,0);
    
    //2*H
    //PKA_MMUL(0,3, 5,3, 9,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3, 5,3,9,3,7,3,0,0);
    
    //X2 = 2*H*S
    //PKA_MMUL(0,3, 5,3, 5,3,14,3,0);
    Sec_Eng_PKA_MMUL(3, 5,3,5,3,14,3,0,0);
    
    //4*B
    //PKA_MMUL(0,3,15,3,11,3,15,3,0);
    Sec_Eng_PKA_MMUL(3,15,3,11,3,15,3,0,0);
    
    //S^2
    //PKA_MMUL(0,3,16,3,14,3,14,3,0);
    Sec_Eng_PKA_MMUL(3,16,3,14,3,14,3,0,0);
    
    //4*B-H
    //PKA_MSUB(0,3,15,3,15,3, 7,3,0);
    Sec_Eng_PKA_MSUB(3,15,3,15,3,7,3,0,0);
    
    //Y1^2
    //PKA_MMUL(0,3, 6,3, 6,3, 6,3,0);
    Sec_Eng_PKA_MMUL(3,6,3,6,3,6,3,0,0);
    
    //W*(4*B-H)
    //PKA_MMUL(0,3,15,3,15,3,13,3,0);
    Sec_Eng_PKA_MMUL(3,15,3,15,3,13,3,0,0);
    
    //8*Y1^2
    //PKA_MMUL(0,3, 6,3,12,3, 6,3,0);
    Sec_Eng_PKA_MMUL(3,6,3,12,3,6,3,0,0);
    
    //8*Y1^2*S^2
    //PKA_MMUL(0,3, 6,3, 6,3,16,3,0);
    Sec_Eng_PKA_MMUL(3,6,3,6,3,16,3,0,0);
    
    //Y2 = W*(4*B-H)-8*Y1^2*S^2
    //PKA_MSUB(0,3, 6,3,15,3, 6,3,0);
    Sec_Eng_PKA_MSUB(3,6,3,15,3,6,3,0,0);
    
    //S^3
    //PKA_MMUL(0,3, 7,3,14,3,16,3,0);
    Sec_Eng_PKA_MMUL(3,7,3,14,3,16,3,0,0);
    
    //Z2 = 8*S^3
    //PKA_MMUL(1,3, 7,3,12,3, 7,3,0);
    Sec_Eng_PKA_MMUL(3,7,3,12,3,7,3,0,1);

}
#ifdef ECDSA_DBG_DETAIL
void bflb_ecdsa_dump_temp_result()
{
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("2=\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("3=\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,4,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("4=\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);

    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("5=\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("6=\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,7,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("7=\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
}
#endif
int bflb_ecdsa_verify_point_mul(uint8_t id,const uint32_t *m )
{
    uint32_t i,j,k;
    uint32_t tmp;
    uint32_t isOne=0;
    uint8_t *p=(uint8_t *)m;
    uint8_t pka_p1_eq_inf,pka_p2_eq_inf;

    /* Remove zeros bytes*/
    k=0;
    while(p[k]==0&&k<31){
        k++;
    }
    i=31;
    for(;i>=k;i--){
        tmp=p[i];
        j=0;
        for(j=0;j<8;j++){
            isOne=tmp&(1<<j);
            if(isOne){
                bflb_ecdsa_point_add_inf_check(&pka_p1_eq_inf,&pka_p2_eq_inf);
                if(pka_p1_eq_inf==1 && pka_p2_eq_inf == 0){
                    //sum = X2
                    bflb_ecdsa_copy_x2_to_x1(id);
#ifdef ECDSA_DBG_DETAIL
                    MSG("sum = X2\r\n");
                    bflb_ecdsa_dump_temp_result();
#endif
                }else if(pka_p1_eq_inf==0 && pka_p2_eq_inf == 1){
                    //sum = X1
                    MSG("sum = X1\r\n");
                }else if(pka_p1_eq_inf==0 && pka_p2_eq_inf == 0){
                    //sum = X1 + X2
                    bflb_ecdsa_point_add(id);
#ifdef ECDSA_DBG_DETAIL
                    MSG("sum = X1+X2\r\n");
                    bflb_ecdsa_dump_temp_result();
#endif
                }else{
                    MSG("Error! infinite point + infinite point\r\n");
                    return -1;
                }

            }
            bflb_ecdsa_point_double(id);
#ifdef ECDSA_DBG_DETAIL
            bflb_ecdsa_dump_temp_result();
#endif
        }
        if(i==0){
            break;
        }
    }


    return 0;
}

int32_t bflb_ecdsa_init(uint8_t id)
{
    return 0;
}

int32_t bflb_ecdsa_verify( uint8_t id,const uint32_t *hash, uint32_t hashLen,const uint32_t *pkX,const uint32_t *pkY, const uint32_t *r, const uint32_t *s)
{
    uint32_t bar_u1_x[8];
    uint32_t bar_u1_y[8];
    uint32_t bar_u1_z[8];
    uint32_t bar_u2_x[8];
    uint32_t bar_u2_y[8];
    uint32_t bar_u2_z[8];
    uint32_t pka_u1[8]={0};
    uint32_t pka_u2[8]={0};
    uint32_t i=0;

    /* Pointer check */
    if(hash==NULL || pkX==NULL || pkY==NULL || r==NULL ||s==NULL){
        return -1;
    }

    /*Step 0: make sure r and s are in range 1..n-1*/

    /* r and s should not be 0*/
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,(uint32_t *)r,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,8,(uint32_t *)secp256r1_1,ECP_SECP256R1_SIZE/4,0);
    //cout = 1 if r = 0
    Sec_Eng_PKA_LCMP((uint8_t*)&i,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,ECP_SECP256R1_REG_TYPE,8);//s0 < s1 => cout = 1
    if(i==1){
        return -1;
    }
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,(uint32_t *)s,ECP_SECP256R1_SIZE/4,0);
    //cout = 1 if r = 0
    Sec_Eng_PKA_LCMP((uint8_t*)&i,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,ECP_SECP256R1_REG_TYPE,8);//s0 < s1 => cout = 1
    if(i==1){
        return -1;
    }

    bflb_ecc_basic_parameter_init(id);

    /* r and s should not be 0*/
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,(uint32_t *)r,ECP_SECP256R1_SIZE/4,0);
    //cout = 1 if r < N
    Sec_Eng_PKA_LCMP((uint8_t*)&i,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX);
    if(i!=1){
        return -1;
    }
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,(uint32_t *)s,ECP_SECP256R1_SIZE/4,0);
    //cout = 1 if r < N
    Sec_Eng_PKA_LCMP((uint8_t*)&i,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX);
    if(i!=1){
        return -1;
    }

    /* u1 = e / s mod n, u2 = r / s mod n
     * R = u1 G + u2 Q*/

    /* Step1: Get S^-1*/
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,(uint32_t *)s,ECP_SECP256R1_SIZE/4,0);
    /* Change s to Mont domain */
    /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,256,
                        ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX);
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("GF2Mont Result of s:\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

    /* Get S^-1 in Mont domain */
    Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_BAR_S_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,
                    ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,1);
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_BAR_S_REG_INDEX,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("s^-1 in Mont:\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

    /* Change S^-1 into GF domain,now  ECP_SECP256R1_S_REG_INDEX store s^-1*/
    /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX, ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_BAR_S_REG_INDEX, ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_INVR_N_REG_INDEX,
                        ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX);
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("S^-1:\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

    /* Step2: Get u1*/
    //u1=hash(e)*s^-1;
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_HASH_REG_INDEX,(uint32_t *)hash,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_LMUL(ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_HASH_REG_INDEX,
                     ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,0);
    Sec_Eng_PKA_MREM(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_U1_REG_INDEX,ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,
                     ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,1);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_U1_REG_INDEX,(uint32_t *)pka_u1,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("u1:\r\n");
    bflb_platform_dump(pka_u1,ECP_SECP256R1_SIZE);
#endif

