espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl602/bl602_std/bl602_std/Common/cipher_suite/src/bflb_ecdsa.c
    /* Step3: Get u2*/
    //u2=r*s^-1;
    // use hash and u1 temp register
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_HASH_REG_INDEX,(uint32_t *)r,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_LMUL(ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_HASH_REG_INDEX,
                         ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_S_REG_INDEX,0);
    Sec_Eng_PKA_MREM(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_U1_REG_INDEX,ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,
                         ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,1);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_U1_REG_INDEX,(uint32_t *)pka_u2,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("u2:\r\n");
    bflb_platform_dump(pka_u2,ECP_SECP256R1_SIZE);
#endif

    /* Step4: Get u1*G*/

    //Clear D[7]
    //PKA_CREG(1,4, 7,0);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_LT_REG_TYPE,7,ECP_SECP256R1_SIZE/4,1);

    bflb_ecc_point_mul_init(id);

    //X1
    //PKA_CTREG(3, 2,8,bar_Zero_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)secp256r1_Zerox,ECP_SECP256R1_SIZE/4,0);
    //Y1
    //PKA_CTREG(3, 3,8,bar_Zero_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)secp256r1_Zeroy,ECP_SECP256R1_SIZE/4,0);
    //Z1
    //PKA_CTREG(3, 4,8,bar_Zero_z);
    //PKA_MOVDAT(1,3, 4,3, 2);
    Sec_Eng_PKA_Move_Data(3,4,3,2,1);

    //X2
    //PKA_CTREG(3, 5,8,bar_G_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)secp256r1_Gx,ECP_SECP256R1_SIZE/4,0);
    //Y2
    //PKA_CTREG(3, 6,8,bar_G_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)secp256r1_Gy,ECP_SECP256R1_SIZE/4,0);
    //Z2
    //PKA_CTREG(3, 7,8,bar_G_z);
    //PKA_MOVDAT(1,3, 7,3, 3);
    Sec_Eng_PKA_Move_Data(3,7,3,3,1);

    bflb_ecdsa_verify_point_mul(id,pka_u1);
    //get bar_u1_x
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)bar_u1_x,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u1_x\r\n");
    bflb_platform_dump(bar_u1_x,ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)bar_u1_y,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u1_y\r\n");
    bflb_platform_dump(bar_u1_y,ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,4,(uint32_t *)bar_u1_z,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u1_z\r\n");
    bflb_platform_dump(bar_u1_z,ECP_SECP256R1_SIZE);
#endif

    /* Step4: Get u2*Q*/
    //X1
    //PKA_CTREG(3, 2,8,bar_Zero_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)secp256r1_Zerox,ECP_SECP256R1_SIZE/4,0);
    //Y1
    //PKA_CTREG(3, 3,8,bar_Zero_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)secp256r1_Zeroy,ECP_SECP256R1_SIZE/4,0);
    //Z1
    //PKA_CTREG(3, 4,8,bar_Zero_z);
    //PKA_MOVDAT(1,3, 4,3, 2);
    Sec_Eng_PKA_Move_Data(3,4,3,2,1);

    //PUB_x
    //PKA_CTREG(3, 5,8,PUB_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)pkX,ECP_SECP256R1_SIZE/4,0);
    //bar_pub_x
    //PKA_GF2MONT(3, 5,3, 5);
    /* Change s to Mont domain,remember to clear temp register and index 0 is P256*/
    /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE,5,ECP_SECP256R1_REG_TYPE,5,256,
                        ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("PK.x in Mont:\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

    //PUB_y
    //PKA_CTREG(3, 6,8,PUB_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)pkY,ECP_SECP256R1_SIZE/4,0);
    //bar_pub_y
    //PKA_GF2MONT(3, 6,3, 6);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE,6,ECP_SECP256R1_REG_TYPE,6,256,
                        ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
    MSG("PK.y in Mont:\r\n");
    bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

    //bar_pub_z
    //PKA_CTREG(3, 7,8,PUB_z);
    //PKA_MOVDAT(1,3, 7,3, 3);
    Sec_Eng_PKA_Move_Data(3,7,3,3,1);

    /* Clear temp register since it's used in point-mul*/
    Sec_Eng_PKA_CREG(ECP_SECP256R1_LT_REG_TYPE,7,ECP_SECP256R1_SIZE/4,1);

     bflb_ecdsa_verify_point_mul(id,pka_u2);
    //get bar_u1_x
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)bar_u2_x,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u2_x\r\n");
    bflb_platform_dump(bar_u2_x,ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)bar_u2_y,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u2_y\r\n");
    bflb_platform_dump(bar_u2_y,ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,4,(uint32_t *)bar_u2_z,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u2_z\r\n");
    bflb_platform_dump(bar_u2_z,ECP_SECP256R1_SIZE);
#endif

    /* Step5: Get u1*G+u2*Q*/
    //move bar_u2_x
    //PKA_MOVDAT(0,3, 5,3, 2);
    Sec_Eng_PKA_Move_Data(3,5,3,2,0);
    //move bar_u2_y
    //PKA_MOVDAT(0,3, 6,3, 3);
    Sec_Eng_PKA_Move_Data(3,6,3,3,0);
    //move bar_u2_z
    //PKA_MOVDAT(1,3, 7,3, 4);
    Sec_Eng_PKA_Move_Data(3,7,3,4,1);

    //bar_u1_x
    //PKA_CTREG(3, 2,8,bar_u1_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)bar_u1_x,ECP_SECP256R1_SIZE/4,0);
    //bar_u1_y
    //PKA_CTREG(3, 3,8,bar_u1_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)bar_u1_y,ECP_SECP256R1_SIZE/4,0);
    //bar_u1_z
    //PKA_CTREG(3, 4,8,bar_u1_z);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,4,(uint32_t *)bar_u1_z,ECP_SECP256R1_SIZE/4,0);

    //R = u1 * G + u2 * PUB
    //PKA_POINT_ADDITION();
    bflb_ecdsa_point_add(id);

    /* Step6 Get R.x(R=u1G+u2P)*/
    //R.z ^ -1
    //PKA_MINV(0,3, 5,3, 4,3, 0);
    Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE,5,ECP_SECP256R1_REG_TYPE,4,ECP_SECP256R1_REG_TYPE,0,1);
    //inv_r
    //PKA_CTREG(3, 6,8,inv_r);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)secp256r1InvR_P,ECP_SECP256R1_SIZE/4,0);
    //R.z ^ -1
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
    //PKA_MONT2GF(3, 5,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);

    //R.x (Montgomery to GF)
    //PKA_MONT2GF(3, 6,3, 2,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,6, ECP_SECP256R1_REG_TYPE,2, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);

