espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl602/bl602_std/bl602_std/Common/cipher_suite/src/bflb_ecdsa.c
    //R.x (GF to Affine domain)
    //PKA_MONT2GF(3, 2,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,2, ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)bar_u2_x,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("R.x=\r\n");
    bflb_platform_dump(bar_u2_x,ECP_SECP256R1_SIZE);
#endif

    /* Step7 check R.x=r*/
    /* Check Result */
    for(i=0;i<8;i++){
        if(bar_u2_x[i]!=r[i]){
            return -1;
        }
    }
#ifdef ECDSA_DBG
    MSG("Verify success\r\n");
#endif
    return 0;
}

int32_t bflb_ecdsa_deinit(uint8_t id)
{
    return 0;
}

int32_t bflb_ecc_is_zero(uint8_t *a,uint32_t len)
{
    uint32_t i=0;
    for(i=0;i<len;i++){
        if(a[i]!=0){
            return 0;
        }
    }
    return 1;
}

int32_t bflb_ecc_cmp(uint8_t *a,uint8_t *b,uint32_t len)
{
    uint32_t i=0,j=0;

    for(i=0;i<len;i++){
        if(a[i]!=0){
            break;
        }
    }
    for(j=0;j<len;j++){
        if(b[j]!=0){
            break;
        }
    }
    if( i == len && j == len ){
        return( 0 );
    }

   if( i > j ) return(  -1 );
   if( j > i ) return(  1 );

   for( ; i <len; i++ )
   {
       if( a[i] > b[i] ) return(  1 );
       if( a[i] < b[i] ) return( -1 );
   }

   return 0;
}

int32_t bflb_ecc_get_random_value(uint32_t *randomData,uint32_t *maxRef,uint32_t size)
{
    uint32_t maxTry=100;
    int32_t ret=0;

    while(maxTry--){
        ret=bflb_platform_get_random((uint8_t *)randomData,size);
        if(ret<0){
            return -1;
        }
        if(maxRef!=NULL){
            if(bflb_ecc_cmp((uint8_t *)maxRef,(uint8_t *)randomData,size)>0){
                return 0;
            }
        }else{
            return 0;
        }
    }
    return -1;
}

/*cal d*G if pkX(pky)==NULL
 * cal d(bG) if pkX(pky)!=NULL */
int32_t bflb_ecdh_get_public_key( uint8_t id,const uint32_t *pkX,const uint32_t *pkY,const uint32_t *private_key,const uint32_t *pRx,const uint32_t *pRy)
{
#ifdef ECDSA_DBG
    uint32_t pk_z[8];
#endif

    /* Pointer check */
    if(private_key==NULL){
        return -1;
    }

    bflb_ecc_basic_parameter_init(id);

    //Clear D[7]
    //PKA_CREG(1,4, 7,0);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_LT_REG_TYPE,7,ECP_SECP256R1_SIZE/4,1);

    bflb_ecc_point_mul_init(id);

    //X1
    //PKA_CTREG(3, 2,8,bar_Zero_x);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)secp256r1_Zerox,ECP_SECP256R1_SIZE/4,0);
    //Y1
    //PKA_CTREG(3, 3,8,bar_Zero_y);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)secp256r1_Zeroy,ECP_SECP256R1_SIZE/4,0);
    //Z1
    //PKA_CTREG(3, 4,8,bar_Zero_z);
    //PKA_MOVDAT(1,3, 4,3, 2);
    Sec_Eng_PKA_Move_Data(3,4,3,2,1);

    if(pkX==NULL){
       //X2
       //PKA_CTREG(3, 5,8,bar_G_x);
       Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)secp256r1_Gx,ECP_SECP256R1_SIZE/4,0);
       //Y2
       //PKA_CTREG(3, 6,8,bar_G_y);
       Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)secp256r1_Gy,ECP_SECP256R1_SIZE/4,0);
    }else{
       /* chaneg peer's public key to mont domain*/
       //PUB_x
       //PKA_CTREG(3, 5,8,PUB_x);
       Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)pkX,ECP_SECP256R1_SIZE/4,0);
       //bar_pub_x
       //PKA_GF2MONT(3, 5,3, 5);
       /* Change s to Mont domain,remember to clear temp register and index 0 is P256*/
       /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
       Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
       Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
       Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE,5,ECP_SECP256R1_REG_TYPE,5,256,
                           ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
#ifdef ECDSA_DBG
       Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
       MSG("PK.x in Mont:\r\n");
       bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

       //PUB_y
       //PKA_CTREG(3, 6,8,PUB_y);
       Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)pkY,ECP_SECP256R1_SIZE/4,0);
       //bar_pub_y
       //PKA_GF2MONT(3, 6,3, 6);
       Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
       Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
       Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE,6,ECP_SECP256R1_REG_TYPE,6,256,
                           ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
#ifdef ECDSA_DBG
       Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
       MSG("PK.y in Mont:\r\n");
       bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

    }
    //Z2
    //PKA_CTREG(3, 7,8,bar_G_z);
    //PKA_MOVDAT(1,3, 7,3, 3);
    Sec_Eng_PKA_Move_Data(3,7,3,3,1);
    /* Clear temp register since it's used in point-mul*/
    Sec_Eng_PKA_CREG(ECP_SECP256R1_LT_REG_TYPE,7,ECP_SECP256R1_SIZE/4,1);

    bflb_ecdsa_verify_point_mul(id,private_key);
    //get bar_u1_x
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)pRx,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u1_x\r\n");
    bflb_platform_dump(pRx,ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)pRy,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("bar_u1_y\r\n");
    bflb_platform_dump(pRy,ECP_SECP256R1_SIZE);
#endif
#ifdef ECDSA_DBG
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,4,(uint32_t *)pk_z,ECP_SECP256R1_SIZE/4);
    MSG("bar_u1_z\r\n");
    bflb_platform_dump(pk_z,ECP_SECP256R1_SIZE);
#endif

    //get R.x
    //R.z ^ -1
    Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE,5,ECP_SECP256R1_REG_TYPE,4,ECP_SECP256R1_REG_TYPE,0,1);
    //inv_r
    //PKA_CTREG(3, 6,8,inv_r);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)secp256r1InvR_P,ECP_SECP256R1_SIZE/4,0);
    //R.z ^ -1
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
    //PKA_MONT2GF(3, 5,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);

    //R.x (Montgomery to GF)
    //PKA_MONT2GF(3, 6,3, 2,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,6, ECP_SECP256R1_REG_TYPE,2, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);

