espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl602/bl602_std/bl602_std/Common/cipher_suite/src/bflb_ecdsa.c
    //R.x (GF to Affine domain)
    //PKA_MONT2GF(3, 2,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,2, ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)pRx,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("R.x=\r\n");
    bflb_platform_dump(pRx,ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,(uint32_t *)secp256r1N,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_MREM(ECP_SECP256R1_REG_TYPE,2,ECP_SECP256R1_REG_TYPE,2,
                        ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,1);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,2,(uint32_t *)pRx,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("R.x%n=\r\n");
    bflb_platform_dump(pRx,ECP_SECP256R1_SIZE);
#endif

    /*after %n,re write p*/
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_32,0,(uint32_t *)secp256r1P,ECP_SECP256R1_SIZE/4,0);
    //get R.y
    //R.z ^ -1
    Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE,5,ECP_SECP256R1_REG_TYPE,4,ECP_SECP256R1_REG_TYPE,0,1);
    //inv_r
    //PKA_CTREG(3, 6,8,inv_r);
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)secp256r1InvR_P,ECP_SECP256R1_SIZE/4,0);
    //R.z ^ -1
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
    Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
    //PKA_MONT2GF(3, 5,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
    //R.x (Montgomery to GF)
    //PKA_MONT2GF(3, 6,3, 2,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,6, ECP_SECP256R1_REG_TYPE,3, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);

    //R.x (GF to Affine domain)
    //PKA_MONT2GF(3, 2,3, 5,3, 6);
    Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,3, ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE, 6,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,0);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)pRy,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("R.y=\r\n");
    bflb_platform_dump(pRy,ECP_SECP256R1_SIZE);
#endif
    Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,(uint32_t *)secp256r1N,ECP_SECP256R1_SIZE/4,0);
    Sec_Eng_PKA_MREM(ECP_SECP256R1_REG_TYPE,3,ECP_SECP256R1_REG_TYPE,3,
                        ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,1);
    Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,3,(uint32_t *)pRy,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
    MSG("R.y%n=\r\n");
    bflb_platform_dump(pRy,ECP_SECP256R1_SIZE);
#endif
    return 0;
}

int32_t bflb_ecdsa_get_private_key( uint8_t id,uint32_t *private_key)
{
	if(bflb_ecc_get_random_value(private_key,(uint32_t *)secp256r1N,32)<0){
		return -1;
	}
	return 0;
}

int32_t bflb_ecdsa_sign( uint8_t id,const uint32_t *private_key,const uint32_t *random_k,const uint32_t *hash,uint32_t *r,uint32_t *s)
{
    uint32_t k[8];
    uint32_t Rx[8];
    uint32_t Ry[8];
    uint32_t KInvert[8];
    uint32_t maxTry1=100;

    /* Pointer check */
    if(private_key==NULL||hash==NULL||r==NULL||s==NULL){
        return -1;
    }

    while(maxTry1--){
        /* step 1 ,get random k*/
        if(random_k==NULL){
            if(bflb_ecc_get_random_value(k,(uint32_t *)secp256r1N,32)<0){
                return -1;
            }
        }else{
            memcpy(k,random_k,32);
        }
#ifdef ECDSA_DBG
        MSG("Random k:\r\n");
        bflb_platform_dump(k,ECP_SECP256R1_SIZE);
#endif
        /*step 2, calc R=kG*/
        if(bflb_ecdh_get_public_key(id,NULL,NULL,k,Rx,Ry)<0){
            return -1;
        }
        if(bflb_ecc_is_zero((uint8_t *)Rx,32)){
            continue;
        }
        memcpy(r,Rx,32);
#ifdef ECDSA_DBG
        MSG("r:\r\n");
        bflb_platform_dump(r,ECP_SECP256R1_SIZE);
#endif
        bflb_ecc_basic_parameter_init(id);
        /* step 3,get k^-1*/
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)k,ECP_SECP256R1_SIZE/4,0);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,(uint32_t *)secp256r1N,ECP_SECP256R1_SIZE/4,0);
        /* Change k to Mont domain */
        /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX-1,ECP_SECP256R1_SIZE/4,1);
        Sec_Eng_PKA_CREG(ECP_SECP256R1_REG_TYPE,2*ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_SIZE/4,1);
        Sec_Eng_PKA_GF2Mont(ECP_SECP256R1_REG_TYPE,5,ECP_SECP256R1_REG_TYPE,5,256,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/4);
        MSG("GF2Mont Result of k:\r\n");
        bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE);
#endif

        /* Get k^-1 in Mont domain */
        Sec_Eng_PKA_MINV(ECP_SECP256R1_REG_TYPE,6,ECP_SECP256R1_REG_TYPE,5,
                        ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,6,(uint32_t *)KInvert,ECP_SECP256R1_SIZE/4);
        MSG("k^-1 in Mont:\r\n");
        bflb_platform_dump(KInvert,ECP_SECP256R1_SIZE);
#endif

        /* Change k^-1 into GF domain,now  ECP_SECP256R1_S_REG_INDEX store k^-1*/
        /* Clear register for ECP_SECP256R1_LT_REG_INDEX*/
        Sec_Eng_PKA_Mont2GF(ECP_SECP256R1_REG_TYPE,5, ECP_SECP256R1_REG_TYPE,6, ECP_SECP256R1_REG_TYPE, ECP_SECP256R1_INVR_N_REG_INDEX,
                            ECP_SECP256R1_LT_REG_TYPE,ECP_SECP256R1_LT_REG_INDEX,ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX);
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)KInvert,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
        MSG("k^-1:\r\n");
        bflb_platform_dump(KInvert,ECP_SECP256R1_SIZE);
#endif

        /* Step 4,r*d     ((e + r * d) / k) */
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,4,(uint32_t *)private_key,ECP_SECP256R1_SIZE/4,0);
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)r,ECP_SECP256R1_SIZE/4,0);
        Sec_Eng_PKA_LMUL(ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,ECP_SECP256R1_REG_TYPE,4,
                        ECP_SECP256R1_REG_TYPE,5,1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/2);
        MSG("r*d:\r\n");
        bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE*2);
#endif

        /* Step 5,e+r*d   ((e + r * d) / k) */
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)hash,ECP_SECP256R1_SIZE/4,0);
        Sec_Eng_PKA_LADD(ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,
               ECP_SECP256R1_REG_TYPE,5,1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/2);
        MSG("e+r*d:\r\n");
        bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE*2);
#endif

        /* Step 6,(e+r*d)*k^-1   ((e + r * d) / k) */
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,5,(uint32_t *)KInvert,ECP_SECP256R1_SIZE/4,0);
        Sec_Eng_PKA_LMUL(ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,
                       ECP_SECP256R1_REG_TYPE,5,1);
#ifdef ECDSA_DBG
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,(uint32_t *)pka_tmp,ECP_SECP256R1_SIZE/2);
        MSG("(e+r*d)*k^-1:\r\n");
        bflb_platform_dump(pka_tmp,ECP_SECP256R1_SIZE*2);
#endif
        /*N write only this time,add following operation will not change this register*/
        Sec_Eng_PKA_Write_Data(ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,(uint32_t *)secp256r1N,ECP_SECP256R1_SIZE/4,0);
        Sec_Eng_PKA_MREM(ECP_SECP256R1_REG_TYPE,4,ECP_SECP256R1_SLT_REG_TYPE,ECP_SECP256R1_SLT_REG_INDEX,
                       ECP_SECP256R1_REG_TYPE,ECP_SECP256R1_N_REG_INDEX,1);
        Sec_Eng_PKA_Read_Data(ECP_SECP256R1_REG_TYPE,4,(uint32_t *)s,ECP_SECP256R1_SIZE/4);
#ifdef ECDSA_DBG
        MSG("s:\r\n");
        bflb_platform_dump(s,ECP_SECP256R1_SIZE);
#endif
        /* Check s zero*/
        if(bflb_ecc_is_zero((uint8_t *)s,32)){
            continue;
        }
        return 0;
    }
    return -1;
}

